In [1]:
'''A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.
'''

'A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.\n'

In [1]:
import pandas as pd
import numpy as np
import scipy
from scipy import stats

In [2]:
df=pd.read_csv("Cutlets.csv")

In [4]:
df.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [6]:
df.shape

(35, 2)

In [9]:
data1=df[["Unit A"]]

In [10]:
data1

    Unit A
0   6.8090
1   6.4376
2   6.9157
3   7.3012
4   7.4488
5   7.3871
6   6.8755
7   7.0621
8   6.6840
9   6.8236
10  7.3930
11  7.5169
12  6.9246
13  6.9256
14  6.5797
15  6.8394
16  6.5970
17  7.2705
18  7.2828
19  7.3495
20  6.9438
21  7.1560
22  6.5341
23  7.2854
24  6.9952
25  6.8568
26  7.2163
27  6.6801
28  6.9431
29  7.0852
30  6.7794
31  7.2783
32  7.1561
33  7.3943
34  6.9405

In [11]:
data2=df[["Unit B"]]

In [12]:
stats.ttest_ind(data1,data2)

Ttest_indResult(statistic=array([0.72286887]), pvalue=array([0.47223947]))

In [13]:
'''if we reject null hypothesis that there is no difference between the diameter of the cutlet,we will be wrong by a probability of 0.472.
Therefore null hypothesis is true.There is no change in the diameter of cutlet

'''

'if we reject null hypothesis that there is no difference between the diameter of the cutlet,we will be wrong by a probability of 0.472.\nTherefore null hypothesis is true.There is no change in the diameter of cutlet\n\n'

In [2]:
'''A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.
   
  Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.
'''

'A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.\n   \n  Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.\n'

In [14]:
import pandas as pd
import numpy as np
import scipy
from scipy import stats

In [15]:
df=pd.read_csv("LabTAT.csv")

In [16]:
df.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [17]:
df.shape

(120, 4)

In [19]:
lab1=df[["Laboratory 1"]]

In [20]:
lab1

     Laboratory 1
0          185.35
1          170.49
2          192.77
3          177.33
4          193.41
..            ...
115        178.49
116        176.08
117        202.48
118        182.40
119        182.09

[120 rows x 1 columns]

In [21]:
lab2=df[["Laboratory 2"]]

In [23]:
lab3=df[["Laboratory 3"]]

In [24]:
lab4=df[["Laboratory 4"]]

In [25]:
lab1.mean()

Laboratory 1    178.361583
dtype: float64

In [30]:
lab2.mean()

Laboratory 2    178.902917
dtype: float64

In [32]:
lab3.mean()

Laboratory 3    199.91325
dtype: float64

In [34]:
lab4.mean()

Laboratory 4    163.68275
dtype: float64

In [61]:
stats.f_oneway(lab1,lab2,lab3,lab4)

F_onewayResult(statistic=array([118.70421654]), pvalue=array([2.11567089e-57]))

In [4]:
'''if we reject null hypothesis,we will be wrong by a probability 2.11e^-5
pvalue<0.05
Hence we reject null hypothesis'''

'if we reject null hypothesis,we will be wrong by a probability 2.11e^-5\npvalue<0.05\nHence we reject null hypothesis'

In [5]:
'''      Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.
'''

'      Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.\n'

In [29]:
import pandas as pd
import numpy as np
import scipy
from scipy import stats
from scipy.stats import chi2_contingency,chisquare

In [30]:
df=pd.read_csv("BuyerRatio.csv")

In [31]:
df.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [32]:
df.shape

(2, 5)

In [33]:
df.drop(["Observed Values"],axis=1,inplace=True)

In [34]:
df

   East  West  North  South
0    50   142    131     70
1   435  1523   1356    750

In [35]:
data=df.to_numpy()

In [36]:
data

array([[  50,  142,  131,   70],
       [ 435, 1523, 1356,  750]], dtype=int64)

In [37]:
chi2_contingency(data)

Chi2ContingencyResult(statistic=1.595945538661058, pvalue=0.6603094907091882, dof=3, expected_freq=array([[  42.76531299,  146.81287862,  131.11756787,   72.30424052],
       [ 442.23468701, 1518.18712138, 1355.88243213,  747.69575948]]))

In [38]:
# As the p_value is greater than alpha value we accept the null hypothesis
# So we can say all propertions are equal.

In [39]:
'''     TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences
'''

'     TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences\n'

In [54]:
import pandas as pd
import numpy as np
import scipy
from scipy import stats
from scipy.stats import chi2_contingency,chisquare

In [43]:
df=pd.read_csv("Costomer+OrderForm.csv")

In [44]:
df.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [45]:
df.shape

(300, 4)

In [46]:
df.Phillippines.value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [47]:
df.Indonesia.value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [48]:
df.Malta.value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [49]:
df.India.value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [51]:
data=np.array([[271,267,269,280],[29,33,31,20]])

In [52]:
data

array([[271, 267, 269, 280],
       [ 29,  33,  31,  20]])

In [53]:
chi2_contingency(data)

Chi2ContingencyResult(statistic=3.858960685820355, pvalue=0.2771020991233135, dof=3, expected_freq=array([[271.75, 271.75, 271.75, 271.75],
       [ 28.25,  28.25,  28.25,  28.25]]))

In [55]:
''' As the p_value is less than alpha value we rejecting the null hypothesis
 So we can say there is defects in the Customer Order Forms '''

' As the p_value is less than alpha value we rejecting the null hypothesis\n So we can say there is defects in the Customer Order Forms '